Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateRailGeom Property
 Can't create geometry for one or more Rails
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateRailGeom { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateRailGeom As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateRailGeom {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace